// lib/data.ts
export const weddingData = {
  hero: {
    bride: 'София',
    groom: 'Матвей',
    date: '16 мая 2026 года',
  },
  welcome: {
    header: 'Дорогие гости!',
    text: 'Один день в этом году будет для нас особенным, и мы хотим разделить его с вами',
    text2: 'Ждем вас на празднике по случаю нашей свадьбы',
  },
  calendar: {
    header: 'Май 2026'
  },
  location: {
    header: 'Локация',
    place: 'Ресторан Донские зори',
    timing: '16:30',
    address: 'Левобережная ул., 3Г, СТ Донское'
  },
  event: {
    header: 'Программа дня',
    guestGathering: {
      time: '16:30',
      text: 'Сбор гостей',
    },
    galaDinner: {
      time: '17:00',
      text: 'Праздничный ужин',
    },
    cake: {
      time: '20:00',
      text: 'Свадебный торт',
    },
    ending: {
      time: '23:00',
      text: 'Завершение вечера',
    }
  },
  dressCode: {
    header: 'Дресс-код',
    text: 'Для нас самое главное - ваше присутствие! Но мы будем очень признательны, если вы поддержите цветовую гамму спокойных природных оттенков'
  },
  presents: {
    header: 'Подарки',
    text: 'Мы мечтаем о своем собственном саде и будем рады пополнить его вашими растениями. Дописать'
  },
  timer: {
    header: 'До нашей свадьбы осталось'
  },
  form: {
    header: 'Заполни форму'
  },
  contacts: {
    header: 'Контакты',
    text: 'Добавляйтесь в чат в телеграме!',
    phone: '+7(989)707-10-80',
  }
}